Revit 2027 API
DuctPressureDropData.Velocity Property
 The velocity of the duct. Units: (ft/s).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Velocity { get; set; }
Public Property Velocity As Double
	Get
	Set
public:
property double Velocity {
	double get ();
	void set (double value);
}
member Velocity : float with get, set
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace